# FabricReinSpanSymbol Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricReinSpanSymbol Class
Members See Also
---
Represents an instance of a Structural Fabric Reinforcement Symbol in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FabricReinSpanSymbol : IndependentTag
```

Visual Basic
---
```text
Public Class FabricReinSpanSymbol _
	Inherits IndependentTag
```

Visual C++
---
```text
public ref class FabricReinSpanSymbol : public IndependentTag
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..IndependentTag Autodesk.Revit.DB.Structure..::..FabricReinSpanSymbol
# See Also
FabricReinSpanSymbol Members
Autodesk.Revit.DB.Structure Namespace